Week 4 Pandas

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

##13: Konversi nilai numerik ke dalam sejumlah kategori

Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    24
1    58
2    91
3    95
4    69
5     5
6    53
7    75
8    93
9    34

Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    24        dewasa
1    58        dewasa
2    91        manula
3    95        manula
4    69        manula
5     5          anak
6    53        dewasa
7    75        manula
8    93        manula
9    34        dewasa

##14: Menggabungkan (merge) dua Data Frame

Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  14  15  15   7  19
1  16  16   3  13  17
2  15   5  16   7  12
3   1  16   1   2   2
4   4   2  13   3  10

In [5]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C  D   E
0  14  15  15  7  19
2  15   5  16  7  12
3   1  16   1  2   2

In [6]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1  16  16   3  13  17
2  15   5  16   7  12
4   4   2  13   3  10

Menggabungkan dua Data Frame

In [7]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B   C  D   E
0  15  5  16  7  12

In [8]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   1  16   1   2   2
1   4   2  13   3  10
2  14  15  15   7  19
3  15   5  16   7  12
4  16  16   3  13  17

##15: Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

Persiapan Data Frame

In [9]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

Memecah nama depan dan nama belakang

In [10]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

Memecah nama kota dan propinsi

In [11]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

##16: Menata ulang Data Frame dengan mutiple indexes menggunakan unstack()

Persiapan Data Frame

In [13]:
df = pd.read_csv('titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Data Frame dengan multiple indexes dari hasil groupping

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

Menata ulang Data Frame dengan mutiple indexes

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()